#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.chainlink-mud will be updated in-place
  ~ resource "aws_ecs_service" "chainlink-mud" {
        cluster                            = "arn:aws:ecs:us-west-2:348310946995:cluster/chainlink-mud"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 100
        desired_count                      = 1
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 500
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:us-west-2:348310946995:service/chainlink-mud/chainlink-mud"
        launch_type                        = "FARGATE"
        name                               = "chainlink-mud"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "candidate"   = "jerry"
            "environment" = "interview"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-2:348310946995:task-definition/chainlink-mud:47" -> (known after apply)
        wait_for_steady_state              = true

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "chainlink-mud"
            container_port   = 4000
            target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:348310946995:targetgroup/telnet20201111082233115800000001/3c168d9c76e6dbe9"
        }
        load_balancer {
            container_name   = "chainlink-mud"
            container_port   = 4001
            target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:348310946995:targetgroup/http20201111082233118500000003/b337e6fcb40e239f"
        }
        load_balancer {
            container_name   = "chainlink-mud"
            container_port   = 4002
            target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:348310946995:targetgroup/wbskt20201111082233117600000002/c596c02f651ed21a"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-022b6277e5f950cca",
            ]
            subnets          = [
                "subnet-0d75b3c6fde1e4a8a",
                "subnet-0e9b5a60a6049ce16",
            ]
        }
    }

  # aws_ecs_task_definition.chainlink-mud must be replaced
-/+ resource "aws_ecs_task_definition" "chainlink-mud" {
      ~ arn                      = "arn:aws:ecs:us-west-2:348310946995:task-definition/chainlink-mud:47" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "EVENNIA_PG_DB_PASSWORD"
                            value = "qIUMbkdK3k7RvOUSRa5yR2AO"
                        },
                        {
                            name  = "EVENNIA_PG_DB_USERNAME"
                            value = "evennia"
                        },
                        {
                            name  = "EVENNIA_PG_HOST"
                            value = "jerry-interview.canztlccowe8.us-west-2.rds.amazonaws.com"
                        },
                        {
                            name  = "EVENNIA_SUPERUSER_EMAIL"
                            value = "hireme@jerryaldrichiii.com"
                        },
                        {
                            name  = "EVENNIA_SUPERUSER_PASSWORD"
                            value = "supernotsecurechangeme"
                        },
                        {
                            name  = "EVENNIA_SUPERUSER_USERNAME"
                            value = "evennia"
                        },
                    ]
                    essential        = true
                  ~ image            = "348310946995.dkr.ecr.us-west-2.amazonaws.com/chainlink-mud:0.1.0" -> "348310946995.dkr.ecr.us-west-2.amazonaws.com/chainlink-mud:1.0.0"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "jerry-interview-chainlink-mud"
                            awslogs-region        = "us-west-2"
                            awslogs-stream-prefix = "ecs"
                        }
                    }
                    mountPoints      = []
                    name             = "chainlink-mud"
                    portMappings     = [
                        {
                            containerPort = 4000
                            hostPort      = 4000
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4001
                            hostPort      = 4001
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4002
                            hostPort      = 4002
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "512"
        execution_role_arn       = "arn:aws:iam::348310946995:role/jerry-interview-chainlink-mud"
        family                   = "chainlink-mud"
      ~ id                       = "chainlink-mud" -> (known after apply)
        memory                   = "1024"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 47 -> (known after apply)
        tags                     = {
            "candidate"   = "jerry"
            "environment" = "interview"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Test: Functional (Docker Compose)`, Action: `the-commons-projectterragrunt-github-actions3`, Working Directory: `terraform/chainlink-mud`, Workspace: `default`*
